# AreWorksheetGridLinesVisible

## Description
Returns true if the grid lines are enabled for the specified worksheet.

```pascal
FUNCTION AreWorksheetGridLinesVisible(h : HANDLE) : BOOLEAN;
```

```python

def vs.AreWorksheetGridLinesVisible(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to worksheet.|

## Version
Availability: from Vectorworks 2011
## Category
* Worksheets